"""
    20261002_데이터분석_이고은
"""
import pandas as pd

"""
1. pandas를 사용하여 train.csv 파일 데이터를 불러와 DataFrame 으로 저장하시오.
"""
df = pd.read_csv("train.csv", encoding="utf-8-sig")

# ===========================================================================
"""
2. 저장된 데이터에서 상위 5개 행을 출력하시오.
"""
print(df.head())
print()

# ===========================================================================
"""
3. 각 열의 이름, 결측치 여부, 데이터 타입(dtype)을 한 번에 확인하시오.

   df.info()를 실행한 후, 출력 결과를 바탕으로 다음을 기술하시오.    
   - 결측치가 존재하는 열과 결측 개수
   - dtype이 예상과 다르거나 주의가 필요한 열
"""
df.info()
print()
"""
- 결측치가 존재하는 열과 결측 개수
  : Age (177개), Cabin(687개)
- dtype이 예상과 다르거나 주의가 필요한 열
  : Age (예상 int64 -> 실제 float64)
"""